In [1]:
import pandas as pd
import sqlalchemy as sa
import psycopg2 as ps
from sqlalchemy import create_engine

In [2]:
%load_ext sql
%sql postgresql://postgres:lingga28@localhost:2828/datacamp
conn = create_engine('postgresql://postgres:lingga28@localhost/datacamp')

# 1. Filtering using scalar subqueries
### Exercises
Subqueries are incredibly powerful for performing complex filters and transformations. You can filter data based on single, scalar values using a subquery in ways you cannot by using WHERE statements or joins. Subqueries can also be used for more advanced manipulation of your data set. You will likely encounter subqueries in any real-world setting that uses relational databases.

In this exercise, you will generate a list of matches where the total goals scored (for both teams in total) is more than 3 times the average for games in the matches_2013_2014 table, which includes all games played in the 2013/2014 season.

### task 1
### Instruction
Calculate triple the average home + away goals scored across all matches. This will become your subquery in the next step. Note that this column does not have an alias, so it will be called ?column? in your results.

In [3]:
%%sql
SELECT 
-- Select the average of home + away goals, multiplied by 3
	3 * AVG(home_goal + away_goal)
FROM matches_2013_2014;

 * postgresql://postgres:***@localhost:2828/datacamp
1 rows affected.

[(Decimal('8.3004617414248020'),)]

### task 2
### Instruction
- Select the date, home goals, and away goals in the main query.
- Filter the main query for matches where the total goals scored exceed the value in the subquery.

In [4]:
%%sql

SELECT 
	-- Select the date, home goals, and away goals scored
    date,
	home_goal,
	away_goal
FROM  matches_2013_2014
-- Filter for matches where total goals exceeds 3x the average
WHERE (home_goal + away_goal) > 
       (SELECT 3 * AVG(home_goal + away_goal)
        FROM matches_2013_2014);

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(datetime.date(2013, 12, 14), 6, 3),
 (datetime.date(2014, 3, 22), 3, 6),
 (datetime.date(2013, 10, 30), 7, 3)]

# 2. Filtering using a subquery with a list
### Exercises
Your goal in this exercise is to generate a list of teams that never played a game in their home city. Using a subquery, you will generate a list of unique hometeam_ID values from the unfiltered match table to exclude in the team table's team_api_ID column.

In addition to filtering using a single-value (scalar) subquery, you can create a list of values in a subquery to filter data based on a complex set of conditions. This type of subquery generates a one column reference list for the main query. As long as the values in your list match a column in your main query's table, you don't need to use a join -- even if the list is from a separate table.

### Instructions
- Create a subquery in the WHERE clause that retrieves all unique hometeam_ID values from the match table.
- Select the team_long_name and team_short_name from the team table. Exclude all values from the subquery in the main query.

In [5]:
%%sql

SELECT 
	-- Select the team long and short names
	team_long_name,
	team_short_name
FROM team
-- Exclude all values from the subquery
WHERE team_api_id NOT IN
     (SELECT DISTINCT hometeam_id FROM match)
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[('FCV Dender EH', 'DEN'), ('KSV Roeselare', 'ROS'), ('Tubize', 'TUB')]

# 3. Filtering with more complex subquery conditions
### Exercises
In the previous exercise, you generated a list of teams that have no home matches listed in the soccer database using a subquery in WHERE. Let's do some further exploration in this database by creating a list of teams that scored 8 or more goals in a home match.

In order to do this, you will construct a subquery in the WHERE statement with its own filtering condition.

### Instructions
- Create a subquery in WHERE clause that retrieves all hometeam_ID values from match with a home_goal score greater than or equal to 8.
- Select the team_long_name and team_short_name from the team table. Include all values from the subquery in the main query.

In [6]:
%%sql

SELECT
	-- Select the team long and short names
	team_long_name,
	team_short_name
FROM team
-- Filter for teams with 8 or more home goals
WHERE team_api_id IN
	  (SELECT hometeam_id 
       FROM match
       WHERE home_goal >= 8);

 * postgresql://postgres:***@localhost:2828/datacamp
6 rows affected.

[('Manchester United', 'MUN'),
 ('Chelsea', 'CHE'),
 ('Southampton', 'SOU'),
 ('FC Bayern Munich', 'BMU'),
 ('Real Madrid CF', 'REA'),
 ('FC Barcelona', 'BAR')]

# 4. Joining Subqueries in FROM
### Exercises
The match table in the European Soccer Database does not contain country or team names. You can get this information by joining it to the country table, and use this to aggregate information, such as the number of matches played in each country.

If you're interested in filtering data from one of these tables, you can also create a subquery from one of the tables, and then join it to an existing table in the database. A subquery in FROM is an effective way of answering detailed questions that requires filtering or transforming data before including it in your final results.

Your goal in this exercise is to generate a subquery using the match table, and then join that subquery to the country table to calculate information about matches with 10 or more goals in total!

### task 1
### Instruction
Create the subquery to be used in the next step, which selects the country ID and match ID (id) from the match table.
Filter the query for matches with greater than or equal to 10 goals.

In [7]:
%%sql

SELECT 
	-- Select the country ID and match ID
	country_id, 
    id 
FROM match
-- Filter for matches with 10 or more goals in total
WHERE (home_goal + away_goal) >= 10;

 * postgresql://postgres:***@localhost:2828/datacamp
9 rows affected.

[(1729, 3093),
 (1729, 3369),
 (1729, 3566),
 (7809, 9211),
 (13274, 14224),
 (21518, 23444),
 (21518, 24016),
 (21518, 24114),
 (21518, 24123)]

### task 2
### Instruction
- Construct a subquery that selects only matches with 10 or more total goals.
- Inner join the subquery onto country in the main query.
- Select name from country and count the id column from match.

In [8]:
%%sql

SELECT
	-- Select country name and the count match IDs
    c.name AS country_name,
    COUNT(sub.id) AS matches
FROM country AS c
-- Inner join the subquery onto country
-- Select the country id and match id columns
INNER JOIN (SELECT country_id, id 
           FROM match
           -- Filter the subquery by matches with 10+ goals
           WHERE (home_goal + away_goal) >=10) AS sub
ON c.id = sub.country_id
GROUP BY country_name;

 * postgresql://postgres:***@localhost:2828/datacamp
4 rows affected.

[('Netherlands', 1), ('Spain', 4), ('Germany', 1), ('England', 3)]

# 5. Building on Subqueries in FROM
### Exercises
In the previous exercise, you found that England, Netherlands, Germany and Spain were the only countries that had matches in the database where 10 or more goals were scored overall. Let's find out some more details about those matches -- when they were played, during which seasons, and how many of the goals were home versus away goals.

You'll notice that in this exercise, the table alias is excluded for every column selected in the main query. This is because the main query is extracting data from the subquery, which is treated as a single table.

### Instructions
- Complete the subquery inside the FROM clause. Select the country name from the country table, along with the date, the home goal, the away goal, and the total goals columns from the match table.
- Create a column in the subquery that adds home and away goals, called total_goals. This will be used to filter the main query.
- Select the country, date, home goals, and away goals in the main query.
- Filter the main query for games with 10 or more total goals.

In [9]:
%%sql

SELECT
	-- Select country, date, home, and away goals from the subquery
    country,
    date,
    home_goal,
    away_goal
FROM 
	-- Select country name, date, home_goal, away_goal, and total goals in the subquery
	(SELECT c.name AS country, 
     	    m.date, 
     		m.home_goal, 
     		m.away_goal,
           (m.home_goal + m.away_goal) AS total_goals
    FROM match AS m
    LEFT JOIN country AS c
    ON m.country_id = c.id) AS subq
-- Filter by total goals scored in the main query
WHERE total_goals >= 10;

 * postgresql://postgres:***@localhost:2828/datacamp
9 rows affected.

[('England', datetime.date(2011, 8, 28), 8, 2),
 ('England', datetime.date(2012, 12, 29), 7, 3),
 ('England', datetime.date(2013, 5, 19), 5, 5),
 ('Germany', datetime.date(2013, 3, 30), 9, 2),
 ('Netherlands', datetime.date(2011, 11, 6), 6, 4),
 ('Spain', datetime.date(2013, 10, 30), 7, 3),
 ('Spain', datetime.date(2015, 4, 5), 9, 1),
 ('Spain', datetime.date(2015, 5, 23), 7, 3),
 ('Spain', datetime.date(2014, 9, 20), 2, 8)]

# 6. Add a subquery to the SELECT clause
### Exercises
Subqueries in SELECT statements generate a single value that allow you to pass an aggregate value down a data frame. This is useful for performing calculations on data within your database.

In the following exercise, you will construct a query that calculates the average number of goals per match in each country's league.

### Instructions
- In the subquery, select the average total goals by adding home_goal and away_goal.
- Filter the results so that only the average of goals in the 2013/2014 season is calculated.
- In the main query, select the average total goals by adding home_goal and away_goal. This calculates the average goals for each league.
- Filter the results in the main query the same way you filtered the subquery. Group the query by the league name.

In [10]:
%%sql

SELECT 
	l.name AS league,
    -- Select and round the league's total goals
    ROUND(AVG(m.home_goal + m.away_goal), 2) AS avg_goals,
    -- Select & round the average total goals for the season
    (SELECT ROUND(AVG(home_goal + away_goal), 2) 
     FROM match
     WHERE season = '2013/2014') AS overall_avg
FROM league AS l
LEFT JOIN match AS m
ON l.country_id = m.country_id
-- Filter for the 2013/2014 season
WHERE m.season = '2013/2014'
GROUP BY l.name;

 * postgresql://postgres:***@localhost:2828/datacamp
11 rows affected.

[('Switzerland Super League', Decimal('2.89'), Decimal('2.77')),
 ('Poland Ekstraklasa', Decimal('2.64'), Decimal('2.77')),
 ('Netherlands Eredivisie', Decimal('3.20'), Decimal('2.77')),
 ('Scotland Premier League', Decimal('2.75'), Decimal('2.77')),
 ('France Ligue 1', Decimal('2.46'), Decimal('2.77')),
 ('Spain LIGA BBVA', Decimal('2.75'), Decimal('2.77')),
 ('Germany 1. Bundesliga', Decimal('3.16'), Decimal('2.77')),
 ('Italy Serie A', Decimal('2.72'), Decimal('2.77')),
 ('Portugal Liga ZON Sagres', Decimal('2.37'), Decimal('2.77')),
 ('England Premier League', Decimal('2.77'), Decimal('2.77')),
 ('Belgium Jupiler League', Decimal('2.50'), Decimal('2.77'))]

# 7. Subqueries in Select for Calculations
### Exercises
Subqueries in SELECT are a useful way to create calculated columns in a query. A subquery in SELECT can be treated as a single numeric value to use in your calculations. When writing queries in SELECT, it's important to remember that filtering the main query does not filter the subquery -- and vice versa.

In the previous exercise, you created a column to compare each league's average total goals to the overall average goals in the 2013/2014 season. In this exercise, you will add a column that directly compares these values by subtracting the overall average from the subquery.

### Instructions
- Select the average goals scored in a match for each league in the main query.
- Select the average goals scored in a match overall for the 2013/2014 season in the subquery.
- Subtract the subquery from the average number of goals calculated for each league.
- Filter the main query so that only games from the 2013/2014 season are included.

In [11]:
%%sql

SELECT
	-- Select the league name and average goals scored
	l.name AS league,
	ROUND(AVG(m.home_goal + m.away_goal),2) AS avg_goals,
    -- Subtract the overall average from the league average
	ROUND(AVG(m.home_goal + m.away_goal) -
		(SELECT AVG(home_goal + away_goal)
		 FROM match 
         WHERE season = '2013/2014'),2) AS diff
FROM league AS l
LEFT JOIN match AS m
ON l.country_id = m.country_id
-- Only include 2013/2014 results
WHERE season = '2013/2014'
GROUP BY l.name;

 * postgresql://postgres:***@localhost:2828/datacamp
11 rows affected.

[('Switzerland Super League', Decimal('2.89'), Decimal('0.12')),
 ('Poland Ekstraklasa', Decimal('2.64'), Decimal('-0.13')),
 ('Netherlands Eredivisie', Decimal('3.20'), Decimal('0.43')),
 ('Scotland Premier League', Decimal('2.75'), Decimal('-0.02')),
 ('France Ligue 1', Decimal('2.46'), Decimal('-0.31')),
 ('Spain LIGA BBVA', Decimal('2.75'), Decimal('-0.02')),
 ('Germany 1. Bundesliga', Decimal('3.16'), Decimal('0.39')),
 ('Italy Serie A', Decimal('2.72'), Decimal('-0.04')),
 ('Portugal Liga ZON Sagres', Decimal('2.37'), Decimal('-0.40')),
 ('England Premier League', Decimal('2.77'), Decimal('0.00')),
 ('Belgium Jupiler League', Decimal('2.50'), Decimal('-0.27'))]

# 8. ALL the subqueries EVERYWHERE
### Exercises
In soccer leagues, games are played at different stages. Winning teams progress from one stage to the next, until they reach the final stage. In each stage, the stakes become higher than the previous one. The match table includes data about the different stages that each match took place in.

In this lesson, you will build a final query across 3 exercises that will contain three subqueries -- one in the SELECT clause, one in the FROM clause, and one in the WHERE clause. In the final exercise, your query will extract data examining the average goals scored in each stage of a match. Does the average number of goals scored change as the stakes get higher from one stage to the next?

### Instructions
- Extract the average number of home and away team goals in two SELECT subqueries.
- Calculate the average home and away goals for the specific stage in the main query.
- Filter both subqueries and the main query so that only data from the 2012/2013 season is included.
- Group the query by the m.stage column.

In [12]:
%%sql

SELECT 
	-- Select the stage and average goals for each stage
	m.stage,
    ROUND(AVG(m.home_goal + m.away_goal),2) AS avg_goals,
    -- Select the average overall goals for the 2012/2013 season
    ROUND((SELECT AVG(home_goal + away_goal) 
           FROM match 
           WHERE season = '2012/2013'),2) AS overall
FROM match AS m
-- Filter for the 2012/2013 season
WHERE season = '2012/2013'
-- Group by stage
GROUP BY stage
LIMIT 3; --just an addition, so that the table is not elongated

 * postgresql://postgres:***@localhost:2828/datacamp
3 rows affected.

[(29, Decimal('2.63'), Decimal('2.77')),
 (4, Decimal('2.80'), Decimal('2.77')),
 (34, Decimal('2.68'), Decimal('2.77'))]

# 9. Add a subquery in FROM
### Exercises
In the previous exercise, you created a data set listing the average home and away goals in each match stage of the 2012/2013 match season.

In this next step, you will turn the main query into a subquery to extract a list of stages where the average home goals in a stage is higher than the overall average for home goals in a match.

### Instructions
- Calculate the average home goals and average away goals from the match table for each stage in the FROM clause subquery.
- Add a subquery to the WHERE clause that calculates the overall average home goals.
- Filter the main query for stages where the average home goals is higher than the overall average.
- Select the stage and avg_goals columns from the s subquery into the main query.

In [13]:
%%sql

SELECT 
	-- Select the stage and average goals from the subquery
	s.stage,
	ROUND(s.avg_goals,2) AS avg_goals
FROM 
	-- Select the stage and average goals in 2012/2013
	(SELECT
		 stage,
         AVG(home_goal + away_goal) AS avg_goals
	 FROM match
	 WHERE season = '2012/2013'
	 GROUP BY stage) AS s
WHERE 
	-- Filter the main query using the subquery
	s.avg_goals > (SELECT AVG(home_goal + away_goal) 
                    FROM match WHERE season = '2012/2013');

 * postgresql://postgres:***@localhost:2828/datacamp
17 rows affected.

[(4, Decimal('2.80')),
 (10, Decimal('2.96')),
 (38, Decimal('3.17')),
 (6, Decimal('2.78')),
 (12, Decimal('3.23')),
 (36, Decimal('2.90')),
 (31, Decimal('3.06')),
 (30, Decimal('2.87')),
 (21, Decimal('2.90')),
 (3, Decimal('2.83')),
 (17, Decimal('2.85')),
 (20, Decimal('2.96')),
 (33, Decimal('3.10')),
 (27, Decimal('2.80')),
 (23, Decimal('3.01')),
 (8, Decimal('3.09')),
 (11, Decimal('2.92'))]

# 10. Add a subquery in SELECT
### Exercises
In the previous exercise, you added a subquery to the FROM statement and selected the stages where the number of average goals in a stage exceeded the overall average number of goals in the 2012/2013 match season. In this final step, you will add a subquery in SELECT to compare the average number of goals scored in each stage to the total.

### Instructions
- Create a subquery in SELECT that yields the average goals scored in the 2012/2013 season. Name the new column overall_avg.
- Create a subquery in FROM that calculates the average goals scored in each stage during the 2012/2013 season.
- Filter the main query for stages where the average goals exceeds the overall average in 2012/2013.

In [14]:
%%sql

SELECT 
	-- Select the stage and average goals from s
	s.stage,
    ROUND(s.avg_goals,2) AS avg_goal,
    -- Select the overall average for 2012/2013
    (SELECT AVG(home_goal + away_goal) FROM match WHERE season = '2012/2013') AS overall_avg
FROM 
	-- Select the stage and average goals in 2012/2013 from match
	(SELECT
		 stage,
         AVG(home_goal + away_goal) AS avg_goals
	 FROM match
	 WHERE season = '2012/2013'
	 GROUP BY stage) AS s
WHERE 
	-- Filter the main query using the subquery
	s.avg_goals > (SELECT AVG(home_goal + away_goal) 
                    FROM match WHERE season = '2012/2013');

 * postgresql://postgres:***@localhost:2828/datacamp
17 rows affected.

[(4, Decimal('2.80'), Decimal('2.7726993865030675')),
 (10, Decimal('2.96'), Decimal('2.7726993865030675')),
 (38, Decimal('3.17'), Decimal('2.7726993865030675')),
 (6, Decimal('2.78'), Decimal('2.7726993865030675')),
 (12, Decimal('3.23'), Decimal('2.7726993865030675')),
 (36, Decimal('2.90'), Decimal('2.7726993865030675')),
 (31, Decimal('3.06'), Decimal('2.7726993865030675')),
 (30, Decimal('2.87'), Decimal('2.7726993865030675')),
 (21, Decimal('2.90'), Decimal('2.7726993865030675')),
 (3, Decimal('2.83'), Decimal('2.7726993865030675')),
 (17, Decimal('2.85'), Decimal('2.7726993865030675')),
 (20, Decimal('2.96'), Decimal('2.7726993865030675')),
 (33, Decimal('3.10'), Decimal('2.7726993865030675')),
 (27, Decimal('2.80'), Decimal('2.7726993865030675')),
 (23, Decimal('3.01'), Decimal('2.7726993865030675')),
 (8, Decimal('3.09'), Decimal('2.7726993865030675')),
 (11, Decimal('2.92'), Decimal('2.7726993865030675'))]